BG2BKK/nordic_nrf51822_demo/sdk11/examples/ble_peripheral/ble_app_oled/main.c
/**@brief Function for handling the Device Manager events.
 *
 * @param[in] p_evt  Data associated to the device manager event.
 */
static uint32_t device_manager_evt_handler(dm_handle_t const * p_handle,
                                           dm_event_t const  * p_event,
                                           ret_code_t        event_result)
{
    APP_ERROR_CHECK(event_result);

#ifdef BLE_DFU_APP_SUPPORT
    if (p_event->event_id == DM_EVT_LINK_SECURED)
    {
        app_context_load(p_handle);
    }
#endif // BLE_DFU_APP_SUPPORT

    return NRF_SUCCESS;
}


/**@brief Function for the Device Manager initialization.
 *
 * @param[in] erase_bonds  Indicates whether bonding information should be cleared from
 *                         persistent storage during initialization of the Device Manager.
 */
static void device_manager_init(bool erase_bonds)
{
    uint32_t               err_code;
    dm_init_param_t        init_param = {.clear_persistent_data = erase_bonds};
    dm_application_param_t register_param;

    // Initialize persistent storage module.
    err_code = pstorage_init();
    APP_ERROR_CHECK(err_code);

    err_code = dm_init(&init_param);
    APP_ERROR_CHECK(err_code);

    memset(&register_param.sec_param, 0, sizeof(ble_gap_sec_params_t));

    register_param.sec_param.bond         = SEC_PARAM_BOND;
    register_param.sec_param.mitm         = SEC_PARAM_MITM;
    register_param.sec_param.lesc         = SEC_PARAM_LESC;
    register_param.sec_param.keypress     = SEC_PARAM_KEYPRESS;
    register_param.sec_param.io_caps      = SEC_PARAM_IO_CAPABILITIES;
    register_param.sec_param.oob          = SEC_PARAM_OOB;
    register_param.sec_param.min_key_size = SEC_PARAM_MIN_KEY_SIZE;
    register_param.sec_param.max_key_size = SEC_PARAM_MAX_KEY_SIZE;
    register_param.evt_handler            = device_manager_evt_handler;
    register_param.service_type           = DM_PROTOCOL_CNTXT_GATT_SRVR_ID;

    err_code = dm_register(&m_app_handle, &register_param);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    uint32_t      err_code;
    ble_advdata_t advdata;

    // Build advertising data struct to pass into @ref ble_advertising_init.
    memset(&advdata, 0, sizeof(advdata));

    advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance      = true;
    advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    advdata.uuids_complete.p_uuids  = m_adv_uuids;

    ble_adv_modes_config_t options = {0};
    options.ble_adv_fast_enabled  = BLE_ADV_FAST_ENABLED;
    options.ble_adv_fast_interval = APP_ADV_INTERVAL;
    options.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;

    err_code = ble_advertising_init(&advdata, NULL, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;
	uint32_t err_code;

	// 为方便调试，我将BSP_INIT_LED和BSP_INIT_BUTTONS都置为0
	// 应该尽快去掉这些button和led相关的代码
    err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS,
                                 APP_TIMER_TICKS(100, APP_TIMER_PRESCALER),
                                 bsp_event_handler);
    APP_ERROR_CHECK(err_code);

  // 初始化用于蓝牙的按键
    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

	printf("what's is this: %d\n", (startup_event == BSP_EVENT_CLEAR_BONDING_DATA));
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for the Power manager.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}

/**@snippet [Handling the data received over UART] */
void uart_event_handle(app_uart_evt_t * p_event) {

}
/**@snippet [Handling the data received over UART] */

/**@snippet [UART Initialization] */
static void uart_init(void)
{
    uint32_t                     err_code;
    const app_uart_comm_params_t comm_params =
    {
        RX_PIN_NUMBER,
        TX_PIN_NUMBER,
        RTS_PIN_NUMBER,
        CTS_PIN_NUMBER,
        APP_UART_FLOW_CONTROL_DISABLED,
        false,
        UART_BAUDRATE_BAUDRATE_Baud115200
    };

    APP_UART_FIFO_INIT( &comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handle,
                       APP_IRQ_PRIORITY_LOW,
                       err_code);
    APP_ERROR_CHECK(err_code);
}
/**@snippet [UART Initialization] */

void user_oled_init() {
	ssd1306_init_i2c(SSD1306_CONFIG_SCL_PIN, SSD1306_CONFIG_SDA_PIN);
	ssd1306_begin(SSD1306_SWITCHCAPVCC, SSD1306_I2C_ADDRESS, false);
	nrf_delay_ms(1);
	ssd1306_clear_display();
	ssd1306_display();
	nrf_delay_ms(1);
}

void user_adc_init() {
	adc_config();
}

void app_user_handler(void *p_context) {
	static bool ble_blink = true;

	user_start_adc();

	ssd1306_clear_display();

	if(user_app_config.is_connected) {
		drawble(80, 0);
	} else if (user_app_config.is_advertising ) {
		if(ble_blink) {
			drawble(80, 0);
			ble_blink = false;
		} else {
			ble_blink = true;
		}
	}

	ssd1306_draw_char(100, 0, user_app_config.oled_data, 1, 0, 2);

	uint16_t adc_sample= user_get_adc();
	if(adc_sample > 999)
		adc_sample = 999;
	else if(adc_sample < 1)
		adc_sample = 0;
	uint8_t c1 = adc_sample / 100 + '0';
	uint8_t c2 = adc_sample / 10 % 10 + '0'; 
	uint8_t c3 = adc_sample % 10 + '0';

	ssd1306_draw_char(12, 24, c1, 1, 0, 5);
	ssd1306_draw_char(52, 24, c2, 1, 0, 5);
	ssd1306_draw_char(92, 24, c3, 1, 0, 5);

	ssd1306_display();
	nrf_delay_ms(0);

	printf("battery: %d\n", adc_sample);

	uint16_t len = sizeof(adc_sample);
}

void user_app_init() {

	uart_init();
	user_oled_init();
	user_adc_init();

	memset(&user_app_config, 0, sizeof(user_app_config_t));
	printf("%s", START_STRING);

	APP_TIMER_DEF(user_app_timer);
	app_timer_create(&user_app_timer, APP_TIMER_MODE_REPEATED, app_user_handler);
	app_timer_start(user_app_timer,  APP_TIMER_TICKS(1000, 0), NULL);
}

/**@brief Function for application main entry.
 */
int main(void)
{
    uint32_t err_code;
    bool erase_bonds;
//    bool erase_bonds = true;

    // Initialize.
    app_trace_init();
    timers_init();

	user_app_init();
//    buttons_leds_init(&erase_bonds);

    ble_stack_init();
	// 似乎device_manager会让app识别出该外围设备支持dfu
    device_manager_init(erase_bonds);
    gap_params_init();
    advertising_init();
    services_init();
//    sensor_simulator_init();
    conn_params_init();

    // Start execution.
//    application_timers_start();
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);

    // Enter main loop.
    for (;;)
    {
        power_manage();
    }
}
